Fluid/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{

    fixed
    {
        type            noSlip;
    }    

    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    up
    {
        type           noSlip;
    }

    down
    {
        type           noSlip;
    }

    left
    {
        type            uniformFixedValue;
        uniformValue  table
(
  (	0	(	0	0	0	)	)
(	0.0005	(	6.02391637155586E-06	0	0	)	)
(	0.001	(	2.40955203359983E-05	0	0	)	)
(	0.0015	(	5.42143764459824E-05	0	0	)	)
(	0.002	(	9.63797589675908E-05	0	0	)	)
(	0.0025	(	0.000150590651898	0	0	)	)
(	0.003	(	0.000216845748989	0	0	)	)
(	0.0035	(	0.000295143453781	0	0	)	)
(	0.004	(	0.000385481879639	0	0	)	)
(	0.0045	(	0.000487858849796	0	0	)	)
(	0.005	(	0.000602271897414	0	0	)	)
(	0.0055	(	0.000728718265632	0	0	)	)
(	0.006	(	0.000867194907642	0	0	)	)
(	0.0065	(	0.001017698486757	0	0	)	)
(	0.007	(	0.001180225376492	0	0	)	)
(	0.0075	(	0.001354771660655	0	0	)	)
(	0.008	(	0.001541333133436	0	0	)	)
(	0.0085	(	0.001739905299513	0	0	)	)
(	0.009	(	0.001950483374156	0	0	)	)
(	0.0095	(	0.002173062283348	0	0	)	)
(	0.01	(	0.002407636663902	0	0	)	)
(	0.0105	(	0.00265420086359	0	0	)	)
(	0.011	(	0.002912748941286	0	0	)	)
(	0.0115	(	0.003183274667101	0	0	)	)
(	0.012	(	0.003465771522537	0	0	)	)
(	0.0125	(	0.003760232700645	0	0	)	)
(	0.013	(	0.004066651106187	0	0	)	)
(	0.0135	(	0.004385019355807	0	0	)	)
(	0.014	(	0.004715329778211	0	0	)	)
(	0.0145	(	0.00505757441435	0	0	)	)
(	0.015	(	0.00541174501761	0	0	)	)
(	0.0155	(	0.005777833054015	0	0	)	)
(	0.016	(	0.006155829702431	0	0	)	)
(	0.0165	(	0.006545725854777	0	0	)	)
(	0.017	(	0.006947512116246	0	0	)	)
(	0.0175	(	0.007361178805529	0	0	)	)
(	0.018	(	0.007786715955054	0	0	)	)
(	0.0185	(	0.008224113311219	0	0	)	)
(	0.019	(	0.008673360334644	0	0	)	)
(	0.0195	(	0.009134446200423	0	0	)	)
(	0.02	(	0.009607359798385	0	0	)	)
(	0.0205	(	0.010092089733362	0	0	)	)
(	0.021	(	0.010588624325464	0	0	)	)
(	0.0215	(	0.011096951610359	0	0	)	)
(	0.022	(	0.011617059339564	0	0	)	)
(	0.0225	(	0.012148934980736	0	0	)	)
(	0.023	(	0.012692565717978	0	0	)	)
(	0.0235	(	0.013247938452145	0	0	)	)
(	0.024	(	0.013815039801162	0	0	)	)
(	0.0245	(	0.014393856100344	0	0	)	)
(	0.025	(	0.014984373402728	0	0	)	)
(	0.0255	(	0.015586577479406	0	0	)	)
(	0.026	(	0.01620045381987	0	0	)	)
(	0.0265	(	0.016825987632361	0	0	)	)
(	0.027	(	0.017463163844226	0	0	)	)
(	0.0275	(	0.01811196710228	0	0	)	)
(	0.028	(	0.018772381773176	0	0	)	)
(	0.0285	(	0.019444391943784	0	0	)	)
(	0.029	(	0.020127981421571	0	0	)	)
(	0.0295	(	0.020823133734994	0	0	)	)
(	0.03	(	0.021529832133896	0	0	)	)
(	0.0305	(	0.022248059589907	0	0	)	)
(	0.031	(	0.02297779879686	0	0	)	)
(	0.0315	(	0.023719032171202	0	0	)	)
(	0.032	(	0.024471741852423	0	0	)	)
(	0.0325	(	0.025235909703482	0	0	)	)
(	0.033	(	0.026011517311245	0	0	)	)
(	0.0335	(	0.026798545986931	0	0	)	)
(	0.034	(	0.027596976766561	0	0	)	)
(	0.0345	(	0.028406790411413	0	0	)	)
(	0.035	(	0.02922796740849	0	0	)	)
(	0.0355	(	0.030060487970984	0	0	)	)
(	0.036	(	0.030904332038758	0	0	)	)
(	0.0365	(	0.031759479278829	0	0	)	)
(	0.037	(	0.032625909085854	0	0	)	)
(	0.0375	(	0.033503600582631	0	0	)	)
(	0.038	(	0.034392532620598	0	0	)	)
(	0.0385	(	0.035292683780348	0	0	)	)
(	0.039	(	0.036204032372138	0	0	)	)
(	0.0395	(	0.037126556436418	0	0	)	)
(	0.04	(	0.038060233744357	0	0	)	)
(	0.0405	(	0.039005041798378	0	0	)	)
(	0.041	(	0.039960957832703	0	0	)	)
(	0.0415	(	0.040927958813898	0	0	)	)
(	0.042	(	0.041906021441432	0	0	)	)
(	0.0425	(	0.042895122148235	0	0	)	)
(	0.043	(	0.043895237101266	0	0	)	)
(	0.0435	(	0.044906342202091	0	0	)	)
(	0.044	(	0.045928413087459	0	0	)	)
(	0.0445	(	0.046961425129893	0	0	)	)
(	0.045	(	0.048005353438278	0	0	)	)
(	0.0455	(	0.049060172858469	0	0	)	)
(	0.046	(	0.050125857973889	0	0	)	)
(	0.0465	(	0.051202383106147	0	0	)	)
(	0.047	(	0.052289722315652	0	0	)	)
(	0.0475	(	0.053387849402242	0	0	)	)
(	0.048	(	0.054496737905816	0	0	)	)
(	0.0485	(	0.055616361106966	0	0	)	)
(	0.049	(	0.056746692027627	0	0	)	)
...
(	7.16	(	1	0	0	)	)


);
}
    right
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
