Fluid/0.orig/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixed
    {
        type            fixedValue;
        value           $internalField;
    }
    flap
    {
        type            fixedValue;
        value           $internalField;
    }
    
    up
    {
        type            slip;
    }

    down
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
   
}

// ************************************************************************* //
