Fluid/0.orig/vorticity
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    fixed
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    flap
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    left
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    right
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    up
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    down
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
